; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v5 ?v2)
             (pred_10 ?v13 ?v6)
             (pred_1 ?v5 ?v6)
             (pred_12 ?v11 ?v5 )
	     (pred_11 ?v5)
             (pred_8 ?v3)
             (pred_6 ?v13)
             (pred_2 ?v6)
             (pred_9 ?v5)
             (pred_4 ?v13)
             (pred_5 ?v5)
             (pred_3 ))



(:action op_5
:parameters (?v8 ?v9 ?v12 ?v1)
:precondition (and (pred_8 ?v8) (pred_8 ?v9) (pred_6 ?v12) (pred_2 ?v1)
          (pred_7 ?v8 ?v9) (pred_10 ?v12 ?v1)
                   (pred_1 ?v9 ?v1) (pred_11 ?v8) 
                   (pred_9 ?v9) (pred_4 ?v12))
:effect (and  (pred_5 ?v9) (not (pred_9 ?v9))))


(:action op_2
:parameters (?v8 ?v10)
:precondition (and (pred_8 ?v8) (pred_8 ?v10)
               (pred_11 ?v8) (pred_7 ?v8 ?v10) (pred_5 ?v10))
:effect (and (pred_11 ?v10) (not (pred_11 ?v8))))

(:action op_3
:parameters (?v8 ?v12)
:precondition (and (pred_8 ?v8) (pred_6 ?v12) 
                  (pred_11 ?v8) (pred_12 ?v12 ?v8) (pred_3 ))
:effect (and (pred_4 ?v12)
   (not (pred_12 ?v12 ?v8)) (not (pred_3 ))))


(:action op_4
:parameters (?v8 ?v4 ?v7)
:precondition (and (pred_8 ?v8) (pred_6 ?v4) (pred_6 ?v7)
                  (pred_11 ?v8) (pred_4 ?v7) (pred_12 ?v4 ?v8))
:effect (and (pred_4 ?v4) (pred_12 ?v7 ?v8)
        (not (pred_4 ?v7)) (not (pred_12 ?v4 ?v8))))

(:action op_1
:parameters (?v8 ?v12)
:precondition (and (pred_8 ?v8) (pred_6 ?v12) 
                  (pred_11 ?v8) (pred_4 ?v12))
:effect (and (pred_3 ) (pred_12 ?v12 ?v8) (not (pred_4 ?v12)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_14 obj_10 obj_21 obj_26 obj_18 obj_29 obj_01 obj_20 obj_23 obj_13 obj_22 obj_08 obj_15 obj_07 obj_25 obj_24 obj_30 obj_17 obj_19 obj_11 obj_27 obj_03 obj_06 obj_09
    obj_28 obj_12
    obj_05 obj_16 obj_02
    )

    (:init
       (pred_3)

       (pred_8 obj_04)
       (pred_8 obj_14)
       (pred_8 obj_10)
       (pred_8 obj_21)
       (pred_8 obj_26)
       (pred_8 obj_18)
       (pred_8 obj_29)
       (pred_8 obj_01)
       (pred_8 obj_20)
       (pred_8 obj_23)
       (pred_8 obj_13)
       (pred_8 obj_22)
       (pred_8 obj_08)
       (pred_8 obj_15)
       (pred_8 obj_07)
       (pred_8 obj_25)
       (pred_8 obj_24)
       (pred_8 obj_30)
       (pred_8 obj_17)
       (pred_8 obj_19)
       (pred_8 obj_11)
       (pred_8 obj_27)
       (pred_8 obj_03)
       (pred_8 obj_06)
       (pred_8 obj_09)
       (pred_2 obj_28)
       (pred_2 obj_12)
       (pred_6 obj_05)
       (pred_6 obj_16)
       (pred_6 obj_02)

       (pred_7 obj_04 obj_18)
       (pred_7 obj_04 obj_14)
       (pred_7 obj_14 obj_29)
       (pred_7 obj_14 obj_10)
       (pred_7 obj_14 obj_04)
       (pred_7 obj_10 obj_01)
       (pred_7 obj_10 obj_21)
       (pred_7 obj_10 obj_14)
       (pred_7 obj_21 obj_20)
       (pred_7 obj_21 obj_26)
       (pred_7 obj_21 obj_10)
       (pred_7 obj_26 obj_23)
       (pred_7 obj_26 obj_21)
       (pred_7 obj_18 obj_13)
       (pred_7 obj_18 obj_29)
       (pred_7 obj_18 obj_04)
       (pred_7 obj_29 obj_22)
       (pred_7 obj_29 obj_01)
       (pred_7 obj_29 obj_14)
       (pred_7 obj_29 obj_18)
       (pred_7 obj_01 obj_08)
       (pred_7 obj_01 obj_20)
       (pred_7 obj_01 obj_10)
       (pred_7 obj_01 obj_29)
       (pred_7 obj_20 obj_15)
       (pred_7 obj_20 obj_23)
       (pred_7 obj_20 obj_21)
       (pred_7 obj_20 obj_01)
       (pred_7 obj_23 obj_07)
       (pred_7 obj_23 obj_26)
       (pred_7 obj_23 obj_20)
       (pred_7 obj_13 obj_25)
       (pred_7 obj_13 obj_22)
       (pred_7 obj_13 obj_18)
       (pred_7 obj_22 obj_24)
       (pred_7 obj_22 obj_08)
       (pred_7 obj_22 obj_29)
       (pred_7 obj_22 obj_13)
       (pred_7 obj_08 obj_30)
       (pred_7 obj_08 obj_15)
       (pred_7 obj_08 obj_01)
       (pred_7 obj_08 obj_22)
       (pred_7 obj_15 obj_17)
       (pred_7 obj_15 obj_07)
       (pred_7 obj_15 obj_20)
       (pred_7 obj_15 obj_08)
       (pred_7 obj_07 obj_19)
       (pred_7 obj_07 obj_23)
       (pred_7 obj_07 obj_15)
       (pred_7 obj_25 obj_11)
       (pred_7 obj_25 obj_24)
       (pred_7 obj_25 obj_13)
       (pred_7 obj_24 obj_27)
       (pred_7 obj_24 obj_30)
       (pred_7 obj_24 obj_22)
       (pred_7 obj_24 obj_25)
       (pred_7 obj_30 obj_03)
       (pred_7 obj_30 obj_17)
       (pred_7 obj_30 obj_08)
       (pred_7 obj_30 obj_24)
       (pred_7 obj_17 obj_06)
       (pred_7 obj_17 obj_19)
       (pred_7 obj_17 obj_15)
       (pred_7 obj_17 obj_30)
       (pred_7 obj_19 obj_09)
       (pred_7 obj_19 obj_07)
       (pred_7 obj_19 obj_17)
       (pred_7 obj_11 obj_27)
       (pred_7 obj_11 obj_25)
       (pred_7 obj_27 obj_03)
       (pred_7 obj_27 obj_24)
       (pred_7 obj_27 obj_11)
       (pred_7 obj_03 obj_06)
       (pred_7 obj_03 obj_30)
       (pred_7 obj_03 obj_27)
       (pred_7 obj_06 obj_09)
       (pred_7 obj_06 obj_17)
       (pred_7 obj_06 obj_03)
       (pred_7 obj_09 obj_19)
       (pred_7 obj_09 obj_06)
       (pred_9 obj_17)
       (pred_9 obj_10)
       (pred_9 obj_26)
       (pred_1  obj_17 obj_28)
       (pred_1  obj_10 obj_12)
       (pred_1  obj_26 obj_12)
       (pred_5 obj_04)
       (pred_5 obj_14)
       (pred_5 obj_21)
       (pred_5 obj_18)
       (pred_5 obj_29)
       (pred_5 obj_01)
       (pred_5 obj_20)
       (pred_5 obj_23)
       (pred_5 obj_13)
       (pred_5 obj_22)
       (pred_5 obj_08)
       (pred_5 obj_15)
       (pred_5 obj_07)
       (pred_5 obj_25)
       (pred_5 obj_24)
       (pred_5 obj_30)
       (pred_5 obj_19)
       (pred_5 obj_11)
       (pred_5 obj_27)
       (pred_5 obj_03)
       (pred_5 obj_06)
       (pred_5 obj_09)

       (pred_10  obj_05 obj_28)
       (pred_10  obj_16 obj_12)
       (pred_10  obj_02 obj_12)
       (pred_12 obj_05 obj_21)
       (pred_12 obj_16 obj_15)
       (pred_12 obj_02 obj_11)
       (pred_11 obj_09)
    )

    (:goal (and
       (pred_12 obj_16 obj_06)
       (pred_12 obj_02 obj_20)
    ))
(:constraints
  (always (not (pred_11 obj_03)))
)
)

; plan
1. (op_2 obj_09 obj_19)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_19)
   goals met: 0 of 2
2. (op_2 obj_19 obj_07)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_07)
   goals met: 0 of 2
3. (op_2 obj_07 obj_15)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_15)
   goals met: 0 of 2
4. (op_3 obj_15 obj_16)
   deleted: (pred_12 obj_16 obj_15) (pred_3)
   added: (pred_4 obj_16)
   goals met: 0 of 2
5. (op_2 obj_15 obj_08)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_08)
   goals met: 0 of 2
6. (op_2 obj_08 obj_30)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_30)
   goals met: 0 of 2
7. (op_2 obj_30 obj_24)
   deleted: (pred_11 obj_30)
   added: (pred_11 obj_24)
   goals met: 0 of 2
8. (op_2 obj_24 obj_27)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_27)
   goals met: 0 of 2
9. (op_1 obj_27 obj_16)
   deleted: (pred_4 obj_16)
   added: (pred_3) (pred_12 obj_16 obj_27)
   goals met: 0 of 2
10. (op_2 obj_27 obj_11)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_11)
   goals met: 0 of 2
11. (op_3 obj_11 obj_02)
   deleted: (pred_12 obj_02 obj_11) (pred_3)
   added: (pred_4 obj_02)
   goals met: 0 of 2
12. (op_2 obj_11 obj_27)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_27)
   goals met: 0 of 2
13. (op_2 obj_27 obj_24)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_24)
   goals met: 0 of 2
14. (op_1 obj_24 obj_02)
   deleted: (pred_4 obj_02)
   added: (pred_3) (pred_12 obj_02 obj_24)
   goals met: 0 of 2
15. (op_2 obj_24 obj_27)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_27)
   goals met: 0 of 2
16. (op_3 obj_27 obj_16)
   deleted: (pred_12 obj_16 obj_27) (pred_3)
   added: (pred_4 obj_16)
   goals met: 0 of 2
17. (op_2 obj_27 obj_24)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_24)
   goals met: 0 of 2
18. (op_2 obj_24 obj_30)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_30)
   goals met: 0 of 2
19. (op_1 obj_30 obj_16)
   deleted: (pred_4 obj_16)
   added: (pred_3) (pred_12 obj_16 obj_30)
   goals met: 0 of 2
20. (op_2 obj_30 obj_24)
   deleted: (pred_11 obj_30)
   added: (pred_11 obj_24)
   goals met: 0 of 2
21. (op_3 obj_24 obj_02)
   deleted: (pred_12 obj_02 obj_24) (pred_3)
   added: (pred_4 obj_02)
   goals met: 0 of 2
22. (op_2 obj_24 obj_30)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_30)
   goals met: 0 of 2
23. (op_2 obj_30 obj_08)
   deleted: (pred_11 obj_30)
   added: (pred_11 obj_08)
   goals met: 0 of 2
24. (op_2 obj_08 obj_15)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_15)
   goals met: 0 of 2
25. (op_1 obj_15 obj_02)
   deleted: (pred_4 obj_02)
   added: (pred_3) (pred_12 obj_02 obj_15)
   goals met: 0 of 2
26. (op_2 obj_15 obj_08)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_08)
   goals met: 0 of 2
27. (op_2 obj_08 obj_30)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_30)
   goals met: 0 of 2
28. (op_3 obj_30 obj_16)
   deleted: (pred_12 obj_16 obj_30) (pred_3)
   added: (pred_4 obj_16)
   goals met: 0 of 2
29. (op_2 obj_30 obj_08)
   deleted: (pred_11 obj_30)
   added: (pred_11 obj_08)
   goals met: 0 of 2
30. (op_2 obj_08 obj_15)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_15)
   goals met: 0 of 2
31. (op_4 obj_15 obj_02 obj_16)
   deleted: (pred_4 obj_16) (pred_12 obj_02 obj_15)
   added: (pred_4 obj_02) (pred_12 obj_16 obj_15)
   goals met: 0 of 2
32. (op_2 obj_15 obj_20)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_20)
   goals met: 0 of 2
33. (op_1 obj_20 obj_02)
   deleted: (pred_4 obj_02)
   added: (pred_3) (pred_12 obj_02 obj_20)
   goals met: 1 of 2
34. (op_2 obj_20 obj_15)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_15)
   goals met: 1 of 2
35. (op_3 obj_15 obj_16)
   deleted: (pred_12 obj_16 obj_15) (pred_3)
   added: (pred_4 obj_16)
   goals met: 1 of 2
36. (op_2 obj_15 obj_07)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_07)
   goals met: 1 of 2
37. (op_2 obj_07 obj_19)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_19)
   goals met: 1 of 2
38. (op_2 obj_19 obj_09)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_09)
   goals met: 1 of 2
39. (op_2 obj_09 obj_06)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_06)
   goals met: 1 of 2
40. (op_1 obj_06 obj_16)
   deleted: (pred_4 obj_16)
   added: (pred_3) (pred_12 obj_16 obj_06)
   goals met: 2 of 2
